FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCalculationTypes/НачисленияИУдержания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCalculationTypes>
		<Properties>
			<Name>НачисленияИУдержания</Name>
			<Comment>Начисления и удержания</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходовИРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Comment>Переключатель типа и местонахождения объекта</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКОбъекту</Name>
					<Comment>Имя объекта метаданных или путь к файлу объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеИлиУдержание</Name>
					<Comment>Признак начисления или удержания</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.НачислениеИлиУдержание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCalculationTypes>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/ChartsOfCalculationTypes/НачисленияИУдержания/Ext/ManagerModule.bsl
//заполняет предопределённые элементы справочника
//
// Параметры
//	ЗаполнятьВсе - Булево
//
Процедура ЗаполнитьПредопределенныеЭлементы(ЗаполнятьВсе=Ложь) Экспорт
	Макет = ПолучитьМакет("НастройкиПоУмолчанию");
	Если Макет = Неопределено Тогда
		Сообщить("Не обнаружен макет начальных настроек!");
		Возврат;
	КонецЕсли;
	Для НомерСтроки = 1 По Макет.ВысотаТаблицы Цикл
		// Считаем из макета Имя, Наименование, Код, Периодичность, ВидОбъектаПланирования,
		// ВидАналитикиПланирования1, ВидАналитикиПланирования2, ПоказательПлана1, ПоказательПлана2,
		// ПоказательПлана3, Параметры
		СтрИмя = СокрЛП(Макет.Область(НомерСтроки,1).Текст);
		СтрНаименование = СокрЛП(Макет.Область(НомерСтроки,2).Текст);
		СтрКод = СокрЛП(Макет.Область(НомерСтроки,3).Текст);
		СтрСтатьяДоходовИРасходов = СокрЛП(Макет.Область(НомерСтроки,4).Текст);
		СтрСпособРасчета =	СокрЛП(Макет.Область(НомерСтроки,5).Текст);
		СтрНачислениеИлиУдержание =	СокрЛП(Макет.Область(НомерСтроки,6).Текст);
		//получим элемент вида плана
		СсылкаНачислениеУдержание = ПланыВидовРасчета.НачисленияИУдержания[СтрИмя];
		Если СсылкаНачислениеУдержание.Пустая() Тогда
			Сообщить("Ошибка при заполнении вида плана: '" + СтрНаименование + "'. Указан отсутствующий элемент справочника виды планов!");
			Продолжить;
		Иначе
			ОбъектНачислениеУдержание = СсылкаНачислениеУдержание.ПолучитьОбъект();
		КонецЕсли;
		//будем искать с таким же наименованием
		Запрос = Новый Запрос("
							|ВЫБРАТЬ
							|	НачисленияИУдержания.Ссылка КАК НачислениеУдержание
							|ИЗ
							|	ПланВидовРасчета.НачисленияИУдержания КАК НачисленияИУдержания
							|ГДЕ
							|	НачисленияИУдержания.Предопределенный = ЛОЖЬ
							|	И НачисленияИУдержания.Наименование = &Наименование
							|");
		Запрос.УстановитьПараметр("Наименование",СтрНаименование);
		Выборка = Запрос.Выполнить().Выбрать();
		Номер = 1;
		//если с таким именем есть, будем заменять
		Пока Выборка.Следующий() Цикл
			//используем стандартную обработку
			ФормаЗаменаЗначений = Обработки.ПоискИЗаменаЗначений.ПолучитьФорму();
			ФормаЗаменаЗначений.Программно = Истина;
			СтрокаЗамены = ФормаЗаменаЗначений.ЗаменяемыеЗначения.Добавить();
			СтрокаЗамены.ЧтоЗаменять = Выборка.НачислениеУдержание;
			СтрокаЗамены.НаЧтоЗаменять = СсылкаНачислениеУдержание;
			СтрокаЗамены.Пометка = Истина;
			ФормаЗаменаЗначений.Открыть();
			Сообщить("План видов расчета ""Начисления и удержания"". Произведена замена ссылок на элемент """ + Выборка.НачислениеУдержание + """ ссылками на элемент """ + СсылкаНачислениеУдержание + """");
			//
			ВидПлана = Выборка.ВидПлана.ПолучитьОбъект();
			ВидПлана.Наименование = СтрНаименование+"_" + Номер;
			ВидПлана.Записать();
			Номер = Номер + 1;
		КонецЦикла;
		//заполняем реквизиты
		Если ЗаполнятьВсе Тогда
			ОбъектНачислениеУдержание.Наименование = СтрНаименование;
		ИначеЕсли обЗначениеНеЗаполнено(ОбъектНачислениеУдержание.Наименование) Тогда
			ОбъектНачислениеУдержание.Наименование = СтрНаименование;
		КонецЕсли;	
		//Получим периодичность планирования
		Если НЕ обЗначениеНеЗаполнено(СтрСтатьяДоходовИРасходов) Тогда
			СсылкаСтрСтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов[СтрСтатьяДоходовИРасходов];
			Если СсылкаСтрСтатьяДоходовИРасходов.Пустая() Тогда
				Сообщить("Ошибка при заполнении статьи доходов и расходов элемента: '" + СтрНаименование + "' Значение статья: '"+СтрСтатьяДоходовИРасходов+"' не найдено");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектНачислениеУдержание.СтатьяДоходовИРасходов = СсылкаСтрСтатьяДоходовИРасходов;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектНачислениеУдержание.СтатьяДоходовИРасходов) Тогда
					ОбъектНачислениеУдержание.СтатьяДоходовИРасходов = СсылкаСтрСтатьяДоходовИРасходов;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Сообщить("Ошибка при заполнении статьи доходов и расходов элемента: '" + СтрНаименование + "' Значение статья: '"+СтрСтатьяДоходовИРасходов+"' не найдено");
		КонецЕсли;
		
		//Получим Вид объекта планирования
		Если Не обЗначениеНеЗаполнено(СтрСпособРасчета) Тогда
			СсылкаСпособРасчета = Перечисления.СпособыРасчета[СтрСпособРасчета];
			Если СсылкаСпособРасчета.Пустая() Тогда
				Сообщить("Ошибка при заполнении способа расчета элемента: '" + СтрНаименование + "' Способ расчета: '"+СтрСпособРасчета+"' не найден");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектНачислениеУдержание.СпособРасчета = СсылкаСпособРасчета;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектНачислениеУдержание.СпособРасчета) Тогда
					ОбъектНачислениеУдержание.СпособРасчета = СсылкаСпособРасчета;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Сообщить("Ошибка при заполнении статьи расчета элемента: '" + СтрНаименование + "' Значение статья: '"+СтрСпособРасчета+"' не найдено");
		КонецЕсли;
		
		//Получим признак начисления/удержания
		Если Не обЗначениеНеЗаполнено(СтрНачислениеИлиУдержание) Тогда
			СсылкаНачислениеИлиУдержание = Перечисления.НачислениеИлиУдержание[СтрНачислениеИлиУдержание];
			Если СсылкаНачислениеИлиУдержание.Пустая() Тогда
				Сообщить("Ошибка при заполнении признака начисления/удержания элемента: '" + СтрНаименование + "' Признак начисления/удержания: '"+СтрНачислениеИлиУдержание+"' не найден");
			Иначе
				Если ЗаполнятьВсе Тогда
					ОбъектНачислениеУдержание.НачислениеИлиУдержание = СсылкаНачислениеИлиУдержание;
				ИначеЕсли обЗначениеНеЗаполнено(ОбъектНачислениеУдержание.НачислениеИлиУдержание) Тогда
					ОбъектНачислениеУдержание.НачислениеИлиУдержание = СсылкаНачислениеИлиУдержание;
				КонецЕсли;
			КонецЕсли;
		Иначе
			Сообщить("Ошибка при заполнении признака начисления/удержания элемента: '" + СтрНаименование + "' Значение признака: '"+СтрНачислениеИлиУдержание+"' не найдено");
		КонецЕсли;
		
		//Сохранение справочника
		НовыйЭлемент = ОбъектНачислениеУдержание.ЭтоНовый();
		Если ОбъектНачислениеУдержание.Модифицированность() Тогда
			Попытка		
				ОбъектНачислениеУдержание.Записать();
				Сообщить("План видов расчета ""Начисления и удержания"". "+?(НовыйЭлемент,"Создан","Модифицирован")+" элемент """+СокрЛП(ОбъектНачислениеУдержание.Наименование)+"""");
			Исключение
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры // ЗаполнитьПредопределенныеЭлементы()
